// 程序填空，不要改变与输入输出有关的语句。
// 输入一个正整数repeat (0<repeat<10)，做repeat次下列运算：
// 为鼓励居民节约用水，自来水公司采取按月用水量分段计费的办法，居民应交水费y(元)与月用水量x(吨)的函数关系式如下。
// 输入用户的月用水量x(吨)，计算并输出该用户应支付的水费y(元)(保留2位小数)。要求用嵌套的if-else语句。

//        0        (x<0)
// y = f(x) = 4x/3     (0<=x<=15)
//        2.5x-10.5    (x>15)  

// 输入输出示例：括号内是说明
// 输入
// 3        (repeat=3)
// -0.5     (x=-0.5)
// 9.5      (x=9.5)
// 21.3     (x=21.3)
// 输出
// f(-0.50) = 0.00
// f(9.50) = 12.67
// f(21.30) = 42.75

#include <stdio.h>
void main(void)
{
    int repeat, ri;
    double x, y;

    scanf("%d", &repeat);
    for(ri = 1;ri <= repeat; ri++){
        scanf("%lf", &x);
        if (x<0) {
        	y = 0;
        } else if (x>=0&&x<=15) {
        	y = 4.0*x/3;
        } else if (x>15) {
        	y = 2.5*x-10.5;
        }
        printf("f(%.2f) = %.2f\n", x, y);
    }
}