// 程序填空，不要改变与输入输出有关的语句。
// 输入21世纪所有的闰年。判断闰年的条件是：能被 4 整除但不能被 100 整除，或者能被 400 整除。
// 输出使用语句 printf("%d\n",year);	
// 输入输出示例：括号内是说明
// 输出
// 2000
// 2004
// 2008
// 2012
// 2016
// 2020
// 2024
// 2028
// 2032
// 2036
// 2040
// 2044
// 2048
// 2052
// 2056
// 2060
// 2064
// 2068
// 2072
// 2076
// 2080
// 2084
// 2088
// 2092
// 2096

#include <stdio.h>
int main(void)
{
    int year;

    for(year = 2000; year <= 2099; year++){
    	if (((year%4 == 0)&&(year%100 != 0))||(year%400 ==0)) {
    		printf("%d\n", year);
    	}
	}
}
